-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 3.39.239.11    Database: androidDB
-- ------------------------------------------------------
-- Server version	8.0.35-0ubuntu0.22.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `list`
--

DROP TABLE IF EXISTS `list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `list` (
  `list_idx` int NOT NULL AUTO_INCREMENT COMMENT '게시글 번호',
  `list_title` varchar(100) NOT NULL COMMENT '게시글 제목',
  `list_content` varchar(500) NOT NULL COMMENT '게시글 내용',
  `list_user_nick` varchar(100) NOT NULL COMMENT '게시글 작성자',
  `list_create_date` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '게시글 작성일',
  `list_completed_yn` char(1) NOT NULL DEFAULT 'N' COMMENT '거래 완료 여부',
  `list_hit_cnt` int DEFAULT '0' COMMENT '게시글 조회 수',
  `list_cate` int DEFAULT '0' COMMENT '0 - 판매\n1 - 구매',
  `list_sell_state` int DEFAULT '0' COMMENT '0 - 판매중\\n1 - 거래완료\\n2 - 숨김\\3 - 예약중',
  `list_loc` varchar(500) NOT NULL COMMENT '지역',
  `list_money` int DEFAULT '0' COMMENT '금액',
  `list_update_date` datetime DEFAULT CURRENT_TIMESTAMP,
  `buy_nick` varchar(100) DEFAULT 'N',
  PRIMARY KEY (`list_idx`),
  KEY `fk_nick_idx` (`list_user_nick`),
  KEY `fk_id_idx` (`list_sell_state`),
  CONSTRAINT `fk_nick` FOREIGN KEY (`list_user_nick`) REFERENCES `user` (`user_nick`)
) ENGINE=InnoDB AUTO_INCREMENT=164 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='게시글';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `list`
--

LOCK TABLES `list` WRITE;
/*!40000 ALTER TABLE `list` DISABLE KEYS */;
INSERT INTO `list` VALUES (114,'안녕하세요','고양이 문제','테스터','2024-01-25 06:55:53','N',2,0,1,'부산',20000,'2024-01-28 10:26:35','N'),(115,'이거 질문점','질문해요','테스터','2024-01-25 06:55:55','N',3,0,1,'부산진구',30000,'2024-01-29 00:31:10','N'),(117,'신발팝니다','신발팔아요','테스터','2024-01-25 06:55:59','N',1,0,0,'서면',54555,'2024-01-25 07:44:22','N'),(118,'볼링칠사람구함','경은씨 볼링치죠','테스터','2024-01-25 07:22:22','Y',0,0,2,'학원',10000,'2024-01-28 09:28:42','N'),(121,'매실마켓머임','제곧내','테스터','2024-01-25 07:22:30','Y',0,0,3,'it학원',40000,'2024-01-28 08:34:42','N'),(122,'하기싫다','프로젝트','테스터','2024-01-25 07:22:45','N',1,0,0,'서면역',0,'2024-01-25 07:26:08','N'),(123,'볼링공 직공해요','볼링공은 닥터볼','테스터','2024-01-25 07:23:50','N',1,0,0,'가야동',1550000,'2024-01-25 07:22:38','N'),(125,'fff','fff','테스터','2024-01-25 07:47:26','N',1,0,0,'부산',999,'2024-01-26 12:48:40','N'),(126,'수정됨','','테스터','2024-01-25 07:47:26','N',0,0,0,'부산',87990,'2024-01-29 03:21:24','N'),(127,'테스트 제목14','테스트내용14','테스터','2024-01-25 07:47:26','N',1,0,0,'부산',14,'2024-01-25 07:47:26','N'),(128,'슈즈','1233','테스터','2024-01-25 07:47:26','N',17,1,1,'부산',10000,'2024-01-28 16:57:45','가야동 곽형'),(130,'테스트 제목17','테스트내용17','테스터','2024-01-25 07:47:26','N',1,0,2,'부산',17,'2024-01-28 09:47:53','N'),(131,'테스트 제목18','테스트내용18','테스터','2024-01-25 07:47:26','Y',0,0,0,'부산',18,'2024-01-25 07:50:27','N'),(134,'home','home','테스터','2024-01-25 09:56:14','N',0,0,1,'bu',312321,'2024-01-28 09:50:28','N'),(135,'3123213','4124214','테스터','2024-01-25 09:59:18','N',0,0,0,'657567',312312,'2024-01-25 21:54:42','N'),(142,'제목','내용내용','테스터','2024-01-25 10:14:29','N',2,0,0,'부',100000,'2024-01-26 01:50:03','N'),(143,'제목','내용내용','테스터','2024-01-25 10:14:31','N',4,0,1,'부',100000,'2024-01-28 10:44:56','N'),(144,'제목','내용내용','테스터','2024-01-25 10:14:32','N',7,0,0,'부',100000,'2024-01-26 01:51:02','N'),(145,'제목','내용내용','테스터','2024-01-25 10:14:38','N',9,0,2,'부',100000,'2024-01-29 01:00:15','N'),(146,'제목','내용내용','테스터','2024-01-25 10:14:56','N',4,1,0,'부',100000,'2024-01-26 05:06:05','N'),(147,'이거로확인','해봐바','테스터','2024-01-25 10:15:35','N',34,1,3,'312321321',123321,'2024-01-28 05:42:50','N'),(148,'게이밍의자 팝니다','에이픽스 게이밍 의자판매합니다.\n게이밍 의자는 하자 있으니 사진 참고해 주세요.\n부산 진구 가야동 이마트 24 직거래 가능해요.','가야동 곽형','2024-01-28 14:40:09','N',32,0,0,'부산 진구 가야동',130000,'2024-01-28 14:40:09','N'),(149,'의자 하나팜요','선제시 하자없음','가야동 곽형','2024-01-28 14:47:42','N',56,1,0,'부산 진구 가야동 이마트24',1000,'2024-01-28 14:47:42','테스터'),(150,'1','2','익스','2024-01-29 01:02:08','N',0,0,0,'5',10000,'2024-01-29 01:02:08','N'),(151,'1234','12344','익스','2024-01-29 01:07:51','N',0,0,0,'123124',100000,'2024-01-29 01:07:51','N'),(152,'신발 팝니다','이지부스트 팝니다 350','익스','2024-01-29 01:08:53','N',3,0,0,'부산 진구 가야동',300000,'2024-01-29 01:08:53','N'),(153,'고양이 신발 참','고양고양','테스터','2024-01-29 01:14:17','N',6,0,3,'고양시',10000,'2024-01-29 01:14:17','N'),(154,'안녕하셈','1234','qwer','2024-01-29 01:45:27','N',12,0,1,'qwe',10000,'2024-01-29 01:51:19','N'),(155,'저희집까지 오시면 공짜로 드려요','교통비 지원 x','psy','2024-01-29 01:53:20','N',13,0,1,'저희 집',0,'2024-01-29 02:15:29','N'),(156,'누가 내 애플워치 박살냄','애플워치 사요','기호이기호기호','2024-01-29 01:54:15','N',3,0,0,'부산 대연동',0,'2024-01-29 01:54:15','N'),(157,'고양이 팔아요\n','','qwer','2024-01-29 01:54:58','N',5,0,0,'진구',100000,'2024-01-29 01:55:42','N'),(158,'다형성	123','발로란트','기호이기호기호','2024-01-29 01:59:39','N',4,0,0,'부산 피시방',50000,'2024-01-29 01:59:39','N'),(159,'챗','중요','가야동 곽형','2024-01-29 02:18:52','N',2,0,0,'부산진구',12345,'2024-01-29 02:18:52','N'),(160,'ChatTest','testcat','테스터','2024-01-29 02:22:34','N',0,0,3,'test',123456,'2024-01-29 02:22:34','N'),(161,'신발 팝니다','이지부스트300 팝니다','블랙핑크 구소룡	','2024-01-29 03:11:34','N',3,0,1,'부산 진구 가야동',10000,'2024-01-29 03:13:56','N'),(162,'5555','31233','블랙핑크 구소룡	','2024-01-29 03:14:21','N',0,0,0,'312312',1123,'2024-01-29 03:14:21','N'),(163,'44134','buy','기호이기호기호','2024-01-29 03:17:04','N',0,0,2,'busan',50000,'2024-01-29 03:17:20','N');
/*!40000 ALTER TABLE `list` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-01-31  9:16:22
